tests/load-test.yml
config:
  target: "http://localhost:5173"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Steady state"
    - duration: 60
      arrivalRate: 20
      name: "Spike"
  defaults:
    headers:
      User-Agent: "Artillery Load Test"
      Accept: "text/html,application/xhtml+xml"

scenarios:
  - name: "Homepage Load"
    weight: 30
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200

  - name: "Search Properties"
    weight: 40
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/search?q=apartment&location=Lagos"
          expect:
            - statusCode: 200

  - name: "Property Details"
    weight: 30
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/property/sample-id"
          expect:
            - statusCode: 200

after:
  flow:
    - log: "Load test completed"